MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX664F128L.atdf
         <register caption="Interrupt Priority Control Register 7" name="IPC7" offset="0x100" rw="RW" size="4">
            <bitfield mask="0x00000003" name="PMPIS" />
            <bitfield mask="0x0000001C" name="PMPIP" />
            <bitfield mask="0x00000300" name="CMP1IS" />
            <bitfield mask="0x00001C00" name="CMP1IP" />
            <bitfield mask="0x00030000" name="CMP2IS" />
            <bitfield mask="0x001C0000" name="CMP2IP" />
            <bitfield mask="0x03000000" name="U3IS" />
            <bitfield mask="0x1C000000" name="U3IP" />
         </register>
         <register caption="Interrupt Priority Control Register 8" name="IPC8" offset="0x110" rw="RW" size="4">
            <bitfield mask="0x00000003" name="U2IS" />
            <bitfield mask="0x0000001C" name="U2IP" />
            <bitfield mask="0x00000300" name="I2C2IS" />
            <bitfield mask="0x00001C00" name="I2C2IP" />
            <bitfield mask="0x00030000" name="FSCMIS" />
            <bitfield mask="0x001C0000" name="FSCMIP" />
            <bitfield mask="0x03000000" name="RTCCIS" />
            <bitfield mask="0x1C000000" name="RTCCIP" />
         </register>
         <register caption="Interrupt Priority Control Register 9" name="IPC9" offset="0x120" rw="RW" size="4">
            <bitfield mask="0x00000003" name="DMA0IS" />
            <bitfield mask="0x0000001C" name="DMA0IP" />
            <bitfield mask="0x00000300" name="DMA1IS" />
            <bitfield mask="0x00001C00" name="DMA1IP" />
            <bitfield mask="0x00030000" name="DMA2IS" />
            <bitfield mask="0x001C0000" name="DMA2IP" />
            <bitfield mask="0x03000000" name="DMA3IS" />
            <bitfield mask="0x1C000000" name="DMA3IP" />
         </register>
         <register caption="Interrupt Priority Control Register 10" name="IPC10" offset="0x130" rw="RW" size="4">
            <bitfield mask="0x00000003" name="DMA4IS" />
            <bitfield mask="0x0000001C" name="DMA4IP" />
            <bitfield mask="0x00000300" name="DMA5IS" />
            <bitfield mask="0x00001C00" name="DMA5IP" />
            <bitfield mask="0x00030000" name="DMA6IS" />
            <bitfield mask="0x001C0000" name="DMA6IP" />
            <bitfield mask="0x03000000" name="DMA7IS" />
            <bitfield mask="0x1C000000" name="DMA7IP" />
         </register>
         <register caption="Interrupt Priority Control Register 11" name="IPC11" offset="0x140" rw="RW" size="4">
            <bitfield mask="0x00000003" name="FCEIS" />
            <bitfield mask="0x0000001C" name="FCEIP" />
            <bitfield mask="0x00000300" name="USBIS" />
            <bitfield mask="0x00001C00" name="USBIP" />
            <bitfield mask="0x00030000" name="CAN1IS" />
            <bitfield mask="0x001C0000" name="CAN1IP" />
            <bitfield mask="0x03000000" name="CAN2IS" />
            <bitfield mask="0x1C000000" name="CAN2IP" />
         </register>
         <register caption="Interrupt Priority Control Register 12" name="IPC12" offset="0x150" rw="RW" size="4">
            <bitfield mask="0x00000003" name="ETHIS" />
            <bitfield mask="0x0000001C" name="ETHIP" />
            <bitfield mask="0x00000300" name="U4IS" />
            <bitfield mask="0x00001C00" name="U4IP" />
            <bitfield mask="0x00030000" name="U6IS" />
            <bitfield mask="0x001C0000" name="U6IP" />
            <bitfield mask="0x03000000" name="U5IS" />
            <bitfield mask="0x1C000000" name="U5IP" />
         </register>
      </register-group>
      <value-group caption="External Interrupt 0 Edge" name="INTCON__INT0EP">
         <value caption="Rising edge" name="" value="0x1" />
         <value caption="Falling edge" name="" value="0x0" />
      </value-group>
      <value-group caption="External Interrupt 1 Edge" name="INTCON__INT1EP">
         <value caption="Rising edge" name="" value="0x1" />
         <value caption="Falling edge" name="" value="0x0" />
      </value-group>
      <value-group caption="External Interrupt 2 Edge" name="INTCON__INT2EP">
         <value caption="Rising edge" name="" value="0x1" />
         <value caption="Falling edge" name="" value="0x0" />
      </value-group>
      <value-group caption="External Interrupt 3 Edge" name="INTCON__INT3EP">
         <value caption="Rising edge" name="" value="0x1" />
         <value caption="Falling edge" name="" value="0x0" />
      </value-group>
      <value-group caption="External Interrupt 4 Edge" name="INTCON__INT4EP">
         <value caption="Rising edge" name="" value="0x1" />
         <value caption="Falling edge" name="" value="0x0" />
      </value-group>
      <value-group caption="Interrupt Proximity Timer Control bits" name="INTCON__TPC">
         <value caption="Interrupts of group priority 7 or lower start the Interrupt Proximity timer" name="" value="0x7" />
         <value caption="Interrupts of group priority 6 or lower start the Interrupt Proximity timer" name="" value="0x6" />
         <value caption="Interrupts of group priority 5 or lower start the Interrupt Proximity timer" name="" value="0x5" />
         <value caption="Interrupts of group priority 4 or lower start the Interrupt Proximity timer" name="" value="0x4" />
         <value caption="Interrupts of group priority 3 or lower start the Interrupt Proximity timer" name="" value="0x3" />
         <value caption="Interrupts of group priority 2 or lower start the Interrupt Proximity timer" name="" value="0x2" />
         <value caption="Interrupts of group priority 1 start the Interrupt Proximity timer" name="" value="0x1" />
         <value caption="Disables Interrupt Proximity timer" name="" value="0x0" />
      </value-group>
      <value-group caption="Multi Vector Configuration bit" name="INTCON__MVEC">
         <value caption="Interrupt controller configured for Multi-vectored mode" name="" value="0x1" />
         <value caption="Interrupt controller configured for Single-vectored mode" name="" value="0x0" />
      </value-group>
      <value-group caption="" name="INTCON__SS0">
         <value caption="Single vector is presented with a shadow register set" name="" value="0x1" />
         <value caption="Single vector is not presented with a shadow register set" name="" value="0x0" />
      </value-group>
      <value-group caption="Interrupt Vector bits" name="INTSTAT__VEC">
         <value caption="The interrupt vector that is presented to the CPU is 31" name="" value="0x1f" />
         <value caption="The interrupt vector that is presented to the CPU is 30" name="" value="0x1e" />
         <value caption="The interrupt vector that is presented to the CPU is 29" name="" value="0x1d" />
         <value caption="The interrupt vector that is presented to the CPU is 28" name="" value="0x1c" />
         <value caption="The interrupt vector that is presented to the CPU is 27" name="" value="0x1b" />
         <value caption="The interrupt vector that is presented to the CPU is 26" name="" value="0x1a" />
         <value caption="The interrupt vector that is presented to the CPU is 25" name="" value="0x19" />
         <value caption="The interrupt vector that is presented to the CPU is 24" name="" value="0x18" />
         <value caption="The interrupt vector that is presented to the CPU is 23" name="" value="0x17" />
         <value caption="The interrupt vector that is presented to the CPU is 22" name="" value="0x16" />
         <value caption="The interrupt vector that is presented to the CPU is 21" name="" value="0x15" />
         <value caption="The interrupt vector that is presented to the CPU is 20" name="" value="0x14" />
         <value caption="The interrupt vector that is presented to the CPU is 19" name="" value="0x13" />
         <value caption="The interrupt vector that is presented to the CPU is 18" name="" value="0x12" />
         <value caption="The interrupt vector that is presented to the CPU is 17" name="" value="0x11" />
         <value caption="The interrupt vector that is presented to the CPU is 16" name="" value="0x10" />
         <value caption="The interrupt vector that is presented to the CPU is 15" name="" value="0xf" />
         <value caption="The interrupt vector that is presented to the CPU is 14" name="" value="0xe" />
         <value caption="The interrupt vector that is presented to the CPU is 13" name="" value="0xd" />
         <value caption="The interrupt vector that is presented to the CPU is 12" name="" value="0xc" />
         <value caption="The interrupt vector that is presented to the CPU is 11" name="" value="0xb" />
         <value caption="The interrupt vector that is presented to the CPU is 10" name="" value="0xa" />
         <value caption="The interrupt vector that is presented to the CPU is 9" name="" value="0x9" />
         <value caption="The interrupt vector that is presented to the CPU is 8" name="" value="0x8" />
         <value caption="The interrupt vector that is presented to the CPU is 7" name="" value="0x7" />
         <value caption="The interrupt vector that is presented to the CPU is 6" name="" value="0x6" />
         <value caption="The interrupt vector that is presented to the CPU is 5" name="" value="0x5" />
         <value caption="The interrupt vector that is presented to the CPU is 4" name="" value="0x4" />
         <value caption="The interrupt vector that is presented to the CPU is 3" name="" value="0x3" />
         <value caption="The interrupt vector that is presented to the CPU is 2" name="" value="0x2" />
         <value caption="The interrupt vector that is presented to the CPU is 1" name="" value="0x1" />
         <value caption="The interrupt vector that is presented to the CPU is 0" name="" value="0x0" />
      </value-group>
